#ifndef __SG90_H
#define __SG90_H
#include "stm32f10x.h"

/** ************************
  * @用途  舵机初始化
  * @参数  void
  * @返回值 void
* ************************/
void SG_90_Init(void);

/** ************************
  * @用途  设定舵机角度
  * @参数  degree 角度0-180  0为最右边 180为最左边 90为正前方
  * @返回值 void
* ************************/
void SG_90_SetDegree(u8 degree);

/** ************************
  * @用途  设定舵机比较值
  * @参数  compare 195-175  
  * @返回值 void
* ************************/
void SG_90_SetCompare(u8 compare);

#endif 

